{
 "problems": {
  "problem_1": {
    "description": "Navigate through the house to find all the scattered apples, collect them and put them in the refrigerator.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Find all the scattered apples around the house, collect them and put them in the refrigerator",
    "objects": {
     "to_add": {
       "apple": {"rooms": ["bedroom", "living_room", "dining_room", "home_office"], "count": 4},
       "fridge": {"rooms": ["kitchen"], "count": 1}
     }
    },
    "relaxation_expected": false
  },
  "problem_2": {
    "description": "Search every room in the house for books, collect them all and organize them on the living room bookshelf.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Collect all books from every room and organize them on the living room bookshelf",
    "objects": {
     "to_add": {
       "bookshelf": {"rooms": ["living_room"], "count": 1},
       "book": {"rooms": ["bedroom", "living_room", "dining_room", "home_office"], "count": 7}
     }
    },
    "relaxation_expected": false
  },
  "problem_3": {
    "description": "Locate all dirty glasses and cups throughout the house and transport them to the kitchen sink.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Bring all glasses and cups from around the house to the kitchen sink",
    "objects": {
     "to_add": {
       "glass": {"rooms": ["living_room", "dining_room", "bedroom", "home_office"], "count": 4},
       "cups": {"rooms": ["living_room", "dining_room", "bedroom", "home_office"], "count": 2},
       "sink": {"rooms": ["kitchen"], "count": 1}
     }
    },
    "relaxation_expected": false
  },
  "problem_4": {
    "description": "Collect all shoes from different locations in the house and organize them neatly in the entrance.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Collect all shoes from the house and organize them in the bathroom",
    "objects": {
     "to_add": {
       "shoes": {"rooms": ["bedroom", "living_room", "corridor", "lobby"], "count": 4},
       "shoe_rack": {"rooms": ["bathroom"], "count": 1}
     }
    },
    "relaxation_expected": false
  },
  "problem_5": {
    "description": "Search for newspapers and magazines scattered throughout the house and put them in the living room magazine rack.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Find all scattered newspapers and magazines and put them in the living room magazine rack",
    "objects": {
     "to_add": {
       "newspaper": {"rooms": ["living_room", "dining_room", "bedroom"], "count": 3},
       "magazine": {"rooms": ["bedroom", "home_office", "living_room"], "count": 3},
       "magazine_rack": {"rooms": ["living_room"], "count": 1}
     }
    },
    "relaxation_expected": false
  },
  "problem_6": {
    "description": "Navigate through all rooms to find toys and consolidate them in the designated toy box.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Collect all toys from every room in the house and put them in the toy box",
    "objects": {
     "to_add": {
       "toy": {"rooms": ["bedroom", "living_room", "corridor"], "count": 4},
       "toy_box": {"rooms": ["living_room"], "count": 1}
     }
    },
    "relaxation_expected": false
  },
  "problem_7": {
    "description": "Collect used towels from all bathrooms in the house and put them in the laundry basket.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Move all used towels from various bathrooms and bring them to the laundry basket",
    "objects": {
     "to_add": {
       "towel": {"rooms": ["bathroom"], "count": 3},
       "laundry_basket": {"rooms": ["bathroom", "storage_room"], "count": 1}
     }
    },
    "relaxation_expected": false
  },
  "problem_8": {
    "description": "Move all the apples from the kitchen to the fruit bowl in the dining room.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Move all apples to the fruit bowl in the dining room",
    "objects": {
     "to_add": {
       "fruit_bowl": {"rooms": ["dining_room"], "count": 1}
     }
    },
    "relaxation_expected": true
  },
  "problem_9": {
    "description": "Organize all magazines by placing them in the magazine rack in the living room.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Put all magazines in the magazine rack in the living room",
    "objects": {
     "to_add": {
       "magazine": {"rooms": ["bedroom", "home_office", "living_room"], "count": 4}
     }
    },
    "relaxation_expected": true
  },
  "problem_10": {
    "description": "Collect exactly 5 glasses from around the house and put them in the kitchen cupboard.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Find 5 glasses and place them in the kitchen cupboard",
    "objects": {
     "to_add": {
       "glass": {"rooms": ["dining_room", "living_room"], "count": 3},
       "cupboard": {"rooms": ["kitchen"], "count": 1}
     }
    },
    "relaxation_expected": true
  },
  "problem_11": {
    "description": "Take all the remote controls and put them on the coffee table in the living room.",
    "graph": ["Klickitat", "Lakeville", "Leonardo", "Lindenwood", "Markleeville", "Marstons"],
    "goal": "Move all remote controls to the coffee table in the living room",
    "objects": {
     "to_add": {
       "coffee_table": {"rooms": ["living_room"], "count": 1}
     }
    },
    "relaxation_expected": true
  }
 },
  "domain": {
    "actions": [
      {
        "name": "move_to",
        "description": "This action moves a robot from one room to another. Arguments: robot (the robot to be moved), from (the room the robot is currently in), to (the room the robot will move to). Preconditions: the robot must be in the 'from' room. Postconditions: the robot is no longer in the 'from' room and is now in the 'to' room."
      },
      {
        "name": "grab",
        "description": "This action allows a robot to grab a grabbable object in a room. Arguments: robot (the robot that will grab the object), what (the grabbable object to be grabbed), where (the room where the object is located). Preconditions: the robot and the object must be in the same room, and the robot must be free (not holding anything). Postconditions: the robot is holding the object, and the object is no longer in the room."
      },
      {
        "name": "drop",
        "description": "This action allows a robot to drop a grabbable object it is holding in a room. Arguments: robot (the robot that will drop the object), what (the grabbable object to be dropped), where (the room where the object will be dropped). Preconditions: the robot must be in the room and holding the object. Postconditions: the robot is no longer holding the object, the robot is free, and the object is now in the room."
      },
      {
        "name": "put_on",
        "description": "This action allows a robot to place a grabbable object onto a surface in a room. Arguments: robot (the robot that will place the object), what (the grabbable object to be placed), on (the surface where the object will be placed), where (the room where the action takes place). Preconditions: the robot, the surface, and the object must be in the same room, and the robot must be holding the object. Postconditions: the robot is no longer holding the object, the object is on the surface, and the robot is free."
      },
      {
        "name": "take_from",
        "description": "This action allows a robot to take a grabbable object from a surface in a room. Arguments: robot (the robot that will take the object), what (the grabbable object to be taken), from (the surface where the object is located), where (the room where the action takes place). Preconditions: the robot, the surface, and the object must be in the same room, and the robot must be free (not holding anything). Postconditions: the robot is holding the object, the object is no longer on the surface, and the robot is no longer free."
      },
      {
        "name": "put_in",
        "description": "This action allows a robot to place a grabbable object into a container in a room. Arguments: robot (the robot that will place the object), what (the grabbable object to be placed), in (the container where the object will be placed), where (the room where the action takes place). Preconditions: the robot, the container, and the object must be in the same room, and the robot must be holding the object. Postconditions: the robot is no longer holding the object, the object is in the container, and the robot is free."
      },
      {
        "name": "take_out",
        "description": "This action allows a robot to take a grabbable object out of a container in a room. Arguments: robot (the robot that will take the object), what (the grabbable object to be taken), from (the container where the object is located), where (the room where the action takes place). Preconditions: the robot, the container, and the object must be in the same room, and the robot must be free (not holding anything). Postconditions: the robot is holding the object, the object is no longer in the container, and the robot is no longer free."
      }
    ],
    "objects": [
      {
        "type": "room",
        "description": "A room is a location where actions can take place. Examples include dining room, kitchen, bedroom, etc."
      },
      {
        "type": "locatable",
        "description": "A locatable object is any object that can be located in a room. This includes robots and grabbable objects."
      },
      {
        "type": "robot",
        "description": "A robot is an entity that can move between rooms and interact with grabbable objects."
      },
      {
        "type": "grabbable",
        "description": "A grabbable object is any object that a robot can pick up and move. Examples include pc parts, kitchenware, etc."
      },
      {
        "type": "surface",
        "description": "A surface is a locatable object on which other objects can be placed. Examples include tables, countertops, etc."
      },
      {
        "type": "container",
        "description": "A locatable container that can hold objects. Examples: fridge, toy_box, cupboard."
      }
    ]
  }
}